Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM1216JH01032.svd
<?xml version="1.0" encoding="UTF-8"?>
<!--
Copyright (c) 2026 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
   <vendor>Microchip Technology</vendor>
   <vendorID>MCHP</vendorID>
   <name>PIC32CM1216JH01032</name>
   <series>PIC32CMJH01</series>
   <version>0</version>
   <description>Microchip PIC32CM1216JH01032 Microcontroller</description>
   <licenseText>
Copyright (c) 2026 Microchip Technology Inc.

SPDX-License-Identifier: Apache-2.0

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
            </licenseText>
   <cpu>
      <name>CM0+</name>
      <revision>r0p0</revision>
      <endian>little</endian>
      <mpuPresent>true</mpuPresent>
      <fpuPresent>false</fpuPresent>
      <vtorPresent>true</vtorPresent>
      <nvicPrioBits>2</nvicPrioBits>
      <vendorSystickConfig>false</vendorSystickConfig>
      <deviceNumInterrupts>32</deviceNumInterrupts>
   </cpu>
   <addressUnitBits>8</addressUnitBits>
   <width>32</width>
   <size>32</size>
   <access>read-write</access>
   <resetValue>0x00000000</resetValue>
   <resetMask>0xFFFFFFFF</resetMask>
   <peripherals>
      <peripheral>
         <name>AC</name>
         <version>U22451.1.1</version>
         <description>Analog Comparators</description>
         <baseAddress>0x42004C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AC</name>
            <description>Analog Comparators</description>
            <value>27</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>START0</name>
                     <description>Comparator 0 Start Comparison</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START1</name>
                     <description>Comparator 1 Start Comparison</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>COMPEO0</name>
                     <description>Comparator 0 Event Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPEO1</name>
                     <description>Comparator 1 Event Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINEO0</name>
                     <description>Window 0 Event Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPEI0</name>
                     <description>Comparator 0 Event Input Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMPEI1</name>
                     <description>Comparator 1 Event Input Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEI0</name>
                     <description>Comparator 0 Input Event Invert Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEI1</name>
                     <description>Comparator 1 Input Event Invert Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>COMP0</name>
                     <description>Comparator 0 Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMP1</name>
                     <description>Comparator 1 Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WIN0</name>
                     <description>Window 0 Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>COMP0</name>
                     <description>Comparator 0 Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMP1</name>
                     <description>Comparator 1 Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WIN0</name>
                     <description>Window 0 Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>COMP0</name>
                     <description>Comparator 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COMP1</name>
                     <description>Comparator 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WIN0</name>
                     <description>Window 0</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>Status A</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>STATE0</name>
                     <description>Comparator 0 Current State</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STATE1</name>
                     <description>Comparator 1 Current State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WSTATE0</name>
                     <description>Window 0 Current State</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WSTATE0Select</name>
                        <enumeratedValue>
                           <name>ABOVE</name>
                           <description>Signal is above window0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INSIDE</name>
                           <description>Signal is inside window0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BELOW</name>
                           <description>Signal is below window0</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSB</name>
               <description>Status B</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>READY0</name>
                     <description>Comparator 0 Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READY1</name>
                     <description>Comparator 1 Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINCTRL</name>
               <description>Window Control</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>WEN0</name>
                     <description>Window 0 Mode Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINTSEL0</name>
                     <description>Window 0 Interrupt Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WINTSEL0Select</name>
                        <enumeratedValue>
                           <name>ABOVE</name>
                           <description>Interrupt on signal above window0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INSIDE</name>
                           <description>Interrupt on signal inside window0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BELOW</name>
                           <description>Interrupt on signal below window0</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTSIDE</name>
                           <description>Interrupt on signal outside window0</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <name>SCALER[%s]</name>
               <description>Scaler n</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Scaler Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
