Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM1216JH01032.svd
               <register>
                  <name>SYNCBUSY</name>
                  <description>SPIS Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRLB</name>
                        <description>CTRLB Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR</name>
                  <description>SPIS Address</description>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>ADDRMASK</name>
                        <description>Address Mask</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>SPIS Data</description>
                  <addressOffset>0x28</addressOffset>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DBGCTRL</name>
                  <description>SPIS Debug Control</description>
                  <addressOffset>0x30</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DBGSTOP</name>
                        <description>Debug Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>SPIM</name>
               <description>SPI Master Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomSpim</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>SPIM Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI in slave operation</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI in master operation</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run during Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IBON</name>
                        <description>Immediate Buffer Overflow Notification</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DOPO</name>
                        <description>Data Out Pinout</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DOPOSelect</name>
                           <enumeratedValue>
                              <name>0x0</name>
                              <description>PAD[0]=DO, PAD[1]=SCK, PAD[2]=SlaveSS</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x1</name>
                              <description>PAD[2]=DO, PAD[3]=SCK, PAD[1]=SlaveSS</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x2</name>
                              <description>PAD[3]=DO, PAD[1]=SCK, PAD[2]=SlaveSS</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x3</name>
                              <description>PAD[0]=DO, PAD[3]=SCK, PAD[1]=SlaveSS</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIPO</name>
                        <description>Data In Pinout</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DIPOSelect</name>
                           <enumeratedValue>
                              <name>0x0</name>
                              <description>SERCOM PAD[0]</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x1</name>
                              <description>SERCOM PAD[1]</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x2</name>
                              <description>SERCOM PAD[2]</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x3</name>
                              <description>SERCOM PAD[3]</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FORM</name>
                        <description>Frame Format</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>FORMSelect</name>
                           <enumeratedValue>
                              <name>SPI_FRAME</name>
                              <description>SPI Frame</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_FRAME_WITH_ADDR</name>
                              <description>SPI Frame with Addr</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPHA</name>
                        <description>Clock Phase</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CPHASelect</name>
                           <enumeratedValue>
                              <name>LEADING_EDGE</name>
                              <description>The data is sampled on a leading SCK edge and changed on a trailing SCK edge</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRAILING_EDGE</name>
                              <description>The data is sampled on a trailing SCK edge and changed on a leading SCK edge</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Clock Polarity</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CPOLSelect</name>
                           <enumeratedValue>
                              <name>IDLE_LOW</name>
                              <description>SCK is low when idle</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IDLE_HIGH</name>
                              <description>SCK is high when idle</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DORD</name>
                        <description>Data Order</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>DORDSelect</name>
                           <enumeratedValue>
                              <name>MSB</name>
                              <description>MSB is transmitted first</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LSB</name>
                              <description>LSB is transmitted first</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>SPIM Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>CHSIZE</name>
                        <description>Character Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>CHSIZESelect</name>
                           <enumeratedValue>
                              <name>8_BIT</name>
                              <description>8 bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9_BIT</name>
                              <description>9 bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PLOADEN</name>
                        <description>Data Preload Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSDE</name>
                        <description>Slave Select Low Detect Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SSDESelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>SS low detector is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>SS low detector is enabled</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MSSEN</name>
                        <description>Master Slave Select Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MSSENSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Hardware SS control is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ENABLE</name>
                              <description>Hardware SS control is enabled</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>AMODE</name>
                        <description>Address Mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>AMODESelect</name>
                           <enumeratedValue>
                              <name>MASK</name>
                              <description>ADDRMASK is used as a mask to the AADR register</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2ADDRS</name>
                              <description>The slave responds to the two unique addresses in ADDR and ADDRMASK</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RANGE</name>
                              <description>The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXEN</name>
                        <description>Receiver Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>SPIM Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>SPIM Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Disable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>SPIM Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>DRE</name>
                        <description>Data Register Empty Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXC</name>
                        <description>Transmit Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXC</name>
                        <description>Receive Complete Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SSL</name>
                        <description>Slave Select Low Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
