Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM1216JH01032.svd
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <name>CCBUF[%s]</name>
                  <description>COUNT32 Compare and Capture Buffer</description>
                  <addressOffset>0x30</addressOffset>
                  <fields>
                     <field>
                        <name>CCBUF</name>
                        <description>Counter/Compare Buffer Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC1</name>
         <baseAddress>0x42003400</baseAddress>
         <interrupt>
            <name>TC1</name>
            <description>Timer/Counter 1</description>
            <value>21</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC2</name>
         <baseAddress>0x42003800</baseAddress>
         <interrupt>
            <name>TC2</name>
            <description>Timer/Counter 2</description>
            <value>22</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC3</name>
         <baseAddress>0x42003C00</baseAddress>
         <interrupt>
            <name>TC3</name>
            <description>Timer/Counter 3</description>
            <value>23</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TC0">
         <name>TC4</name>
         <baseAddress>0x42004000</baseAddress>
         <interrupt>
            <name>TC4</name>
            <description>Timer/Counter 4</description>
            <value>24</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <version>U22511.0.1</version>
         <description>Watchdog Timer</description>
         <baseAddress>0x40002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xD</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>WDT</name>
            <description>Watchdog Timer</description>
            <value>1</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WEN</name>
                     <description>Watchdog Timer Window Mode Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALWAYSON</name>
                     <description>Always-On</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG</name>
               <description>Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0xBB</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>Time-Out Period</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PERSelect</name>
                        <enumeratedValue>
                           <name>CYC8</name>
                           <description>8 clock cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC16</name>
                           <description>16 clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC32</name>
                           <description>32 clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC64</name>
                           <description>64 clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC128</name>
                           <description>128 clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC256</name>
                           <description>256 clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC512</name>
                           <description>512 clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC1024</name>
                           <description>1024 clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC2048</name>
                           <description>2048 clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC4096</name>
                           <description>4096 clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC8192</name>
                           <description>8192 clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC16384</name>
                           <description>16384 clock cycles</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WINDOW</name>
                     <description>Window Mode Time-Out Period</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WINDOWSelect</name>
                        <enumeratedValue>
                           <name>CYC8</name>
                           <description>8 clock cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC16</name>
                           <description>16 clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC32</name>
                           <description>32 clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC64</name>
                           <description>64 clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC128</name>
                           <description>128 clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC256</name>
                           <description>256 clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC512</name>
                           <description>512 clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC1024</name>
                           <description>1024 clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC2048</name>
                           <description>2048 clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC4096</name>
                           <description>4096 clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC8192</name>
                           <description>8192 clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC16384</name>
                           <description>16384 clock cycles</description>
                           <value>0xB</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>EWCTRL</name>
               <description>Early Warning Interrupt Control</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <resetValue>0x0B</resetValue>
               <fields>
                  <field>
                     <name>EWOFFSET</name>
                     <description>Early Warning Interrupt Time Offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EWOFFSETSelect</name>
                        <enumeratedValue>
                           <name>CYC8</name>
                           <description>8 clock cycles</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC16</name>
                           <description>16 clock cycles</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC32</name>
                           <description>32 clock cycles</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC64</name>
                           <description>64 clock cycles</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC128</name>
                           <description>128 clock cycles</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC256</name>
                           <description>256 clock cycles</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC512</name>
                           <description>512 clock cycles</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC1024</name>
                           <description>1024 clock cycles</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC2048</name>
                           <description>2048 clock cycles</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC4096</name>
                           <description>4096 clock cycles</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CYC8192</name>
                           <description>8192 clock cycles</description>
                           <value>0xA</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EW</name>
                     <description>Early Warning Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EW</name>
                     <description>Early Warning Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>EW</name>
                     <description>Early Warning</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNCBUSY</name>
               <description>Synchronization Busy</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable Synchronization Busy</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WEN</name>
                     <description>Window Enable Synchronization Busy</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ALWAYSON</name>
                     <description>Always-On Synchronization Busy</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLEAR</name>
                     <description>Clear Synchronization Busy</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLEAR</name>
               <description>Clear</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CLEAR</name>
                     <description>Watchdog Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLEARSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Clear Key</description>
                           <value>0xA5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
